openfoam/all/subsonic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Cylindrical O-grid background (5-block topology), in METRES (scale 1).
// Flow is +x; model.stl nose tip at x = 0, aft-most plane at x = L.
// gen_case.py renders the domain extents from the part bounding box so the
// mesh adapts to the geometry and the cell count stays ~constant across parts:
//   inlet   xIn   = -5 L          outlet xOut = 11 L
//   farfield radius Rfar = 5 L    outer vertex c = Rfar / sqrt(2)
//   O-grid core half-width a = 5.1 * R_body  (body sits inside the core)
// The axial grading FRACTIONS are L-independent, so only the vertices/arcs scale.

scale   1;

vertices
(
    // inlet plane (x = xIn)
    (-93.4  -4.029  -4.029)   //  0  inner SW
    (-93.4   4.029  -4.029)   //  1  inner SE
    (-93.4   4.029   4.029)   //  2  inner NE
    (-93.4  -4.029   4.029)   //  3  inner NW
    (-93.4  -66.0438  -66.0438)   //  4  outer SW
    (-93.4   66.0438  -66.0438)   //  5  outer SE
    (-93.4   66.0438   66.0438)   //  6  outer NE
    (-93.4  -66.0438   66.0438)   //  7  outer NW

    // outlet plane (x = xOut)
    (205.48  -4.029  -4.029)  //  8  inner SW
    (205.48   4.029  -4.029)  //  9  inner SE
    (205.48   4.029   4.029)  // 10  inner NE
    (205.48  -4.029   4.029)  // 11  inner NW
    (205.48  -66.0438  -66.0438)  // 12  outer SW
    (205.48   66.0438  -66.0438)  // 13  outer SE
    (205.48   66.0438   66.0438)  // 14  outer NE
    (205.48  -66.0438   66.0438)  // 15  outer NW
);

// Axial multi-grading (identical on every block; shared x-edges).
//   zone A  inlet -> ~-0.55L : 30  cells, coarse -> fine  (ratio 0.1)
//   zone B  ~-0.55L -> ~2.46L: 110 cells, ~uniform        (ratio 1)
//   zone C  ~2.46L  -> outlet: 45  cells, fine  -> coarse (ratio 16)
// Total Nx = 185.  Fractions of the 16 L axial span are constant in L.
xGrading
(
    (0.278352 0.162162 0.1)
    (0.187951 0.594595 1)
    (0.533697 0.243243 16)
);

// Radial grading (outer blocks): G grows cells from the core outward to the
// farfield; 1/G is the same edge traversed outer->inner.  Nr = 20.

blocks
(
    // core (square prism around the body) -- uniform transverse
    hex (0 8 9 1 3 11 10 2) (185 20 20)
    simpleGrading ( $xGrading 1 1 )

    // -Z outer block : radial edge runs outer->inner -> 1/G
    hex (4 12 13 5 0 8 9 1) (185 20 20)
    simpleGrading ( $xGrading 1 0.033333 )

    // +Y outer block : radial edge runs inner->outer -> G
    hex (1 9 13 5 2 10 14 6) (185 20 20)
    simpleGrading ( $xGrading 30 1 )

    // +Z outer block : radial edge runs inner->outer -> G
    hex (3 11 10 2 7 15 14 6) (185 20 20)
    simpleGrading ( $xGrading 1 30 )

    // -Y outer block : radial edge runs outer->inner -> 1/G
    hex (4 12 8 0 7 15 11 3) (185 20 20)
    simpleGrading ( $xGrading 0.033333 1 )
);

edges
(
    arc 7 6   (-93.4    0.000   93.4)
    arc 6 5   (-93.4    93.4   0.000)
    arc 4 5   (-93.4    0.000  -93.4)
    arc 4 7   (-93.4   -93.4   0.000)

    arc 15 14 (205.48   0.000   93.4)
    arc 14 13 (205.48   93.4   0.000)
    arc 12 13 (205.48   0.000  -93.4)
    arc 12 15 (205.48  -93.4   0.000)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 0 1 5)
            (1 2 6 5)
            (3 7 6 2)
            (4 7 3 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 10 11)
            (12 13 9 8)
            (9 13 14 10)
            (11 10 14 15)
            (12 8 11 15)
        );
    }
    farfield
    {
        type patch;
        faces
        (
            (7 15 14 6)
            (6 14 13 5)
            (4 5 13 12)
            (4 12 15 7)
        );
    }
);

mergePatchPairs();


// ************************************************************************* //
