openfoam/all/subsonic/system/snappyHexMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object snappyHexMeshDict; }

// Rocket external-aero mesh.  ONE surface, constant/triSurface/model.stl (the
// cleaned part, in METRES -> scale 1), meshed as a single wall patch "model".
// gen_case.py renders the refinement-cylinder extents from the part bounding box
// and the layer first-cell height from the target y+ (300-350) at the case Mach.
// TUNE against checkMesh / the yPlus function object and regenerate as needed.

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    model.stl
    {
        type triSurfaceMesh;
        scale 1;              // model.stl is already in metres
        name model;
    }

    // Broad refinement from upstream of the nose through the near wake.
    broadCylinder
    {
        type searchableCylinder;
        point1 (-8.16316 0.0 0.0);
        point2 (56.04 0.0 0.0);
        radius 6.004;
    }

    // Stronger refinement hugging the body and immediate wake.
    nearBodyCylinder
    {
        type searchableCylinder;
        point1 (-3.06352 0.0 0.0);
        point2 (30.6352 0.0 0.0);
        radius 2.4964;
    }

    // Tight band just outside the body envelope.
    closeBodyCylinder
    {
        type searchableCylinder;
        point1 (-1.0218 0.0 0.0);
        point2 (21.4446 0.0 0.0);
        radius 1.3035;
    }
};

castellatedMeshControls
{
    maxGlobalCells   3000000;
    maxLocalCells    300000;
    minRefinementCells 8;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;

    features
    (
        { file "model.eMesh"; level 4; }
    );

    refinementSurfaces
    {
        model
        {
            level (3 4);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        broadCylinder    { mode inside; levels ((1E15 1)); }
        nearBodyCylinder { mode inside; levels ((1E15 2)); }
        closeBodyCylinder{ mode inside; levels ((1E15 3)); }
    }

    // Upstream of the nose, off the axis -> unambiguously in the fluid.
    locationInMesh (-50.436 1.185 1.185);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      55;
    nRelaxIter      6;
    nFeatureSnapIter 15;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    meshShrinker displacementMedialAxis;

    // Absolute sizing for a wall-function (high-Re) boundary layer.
    // firstLayerThickness is the wall-adjacent cell height; gen_case.py sizes it
    // for y+ ~ 325 at mid-body for the case Mach.  Re-read the yPlus function
    // object after a short run and pass --yplus / --layers to land in 300-350.
    relativeSizes false;
    layers
    {
        model { nSurfaceLayers 6; }
    }
    expansionRatio           1.2;
    firstLayerThickness      0.001339;

    maxFaceThicknessRatio    10.0;
    minThickness             1e-5;
    nSmoothThickness         5;
    nSmoothNormals           3;
    nSmoothSurfaceNormals    3;
    nGrow                    0;
    nBufferCellsNoExtrude    1;
    featureAngle             160;
    slipFeatureAngle         75;
    nRelaxIter               8;
    nRelaxedIter             25;
    nLayerIter               30;

    minMedialAxisAngle       80;
    maxThicknessToMedialRatio 0.6;
    nMedialAxisIter          10;
}

meshQualityControls
{
    maxNonOrtho          75;
    maxBoundarySkewness  20;
    maxInternalSkewness  8;
    maxConcave           80;
    minFlatness          0.5;
    minVol               1e-15;
    minTetQuality        -1e30;
    minArea              -1;
    minTwist             -1;
    minDeterminant       1e-9;
    minFaceWeight        -1;
    minVolRatio          -1;
    minTriangleTwist     -1;
    nSmoothScale         4;
    errorReduction       0.45;

    relaxed
    {
        maxNonOrtho          80;
        minDeterminant       1e-12;
        minFaceWeight        -1;
        minTetQuality        -1e30;
        minTwist             -1;
        minVolRatio          -1;
    }
}

writeFlags
(
    scalarLevels
);

mergeTolerance 1e-8;
