openfoam/all/subsonic/constant/freestreamProperties
/*--------------------------------*- C++ -*----------------------------------*\
| GENERATED by gen_case.py -- edit Ma/alpha/p/T via the script, not here.      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      freestreamProperties;
}
// part=all regime=subsonic  Ma=0.7  alpha=0.0 deg
// static state (sea-level ISA unless overridden): p=101325 Pa, T=288.15 K
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pInf        101325;
TInf        288.15;
RGas        287;

UInfMag     238.184;
UInf        (238.184 0 0);
magUInf     238.184;

rhoInf      1.22523;
qInf        34754.5;
kInf        8.50973;
omegaInf    2490.08;

// force/moment-coefficient references -- FIXED from part="all" so Cd/Cl/Cm are
// comparable across every part and Mach number (frontal area + body length).
Aref        1.96067;
lRef        18.68;
CofR        (0 0 0);
dragDir     (1 0 0);
liftDir     (0 0 1);
pitchAxis   (0 1 0);


// ************************************************************************* //
