openfoam/all/subsonic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
#include "../constant/freestreamProperties"
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $UInf;

boundaryField
{
    // External-aero far field for a segregated (rhoSimpleFoam) solve.
    // freestreamVelocity self-switches between inflow (fixedValue $UInf) and
    // outflow (zeroGradient) on every outer patch using the local flux.
    "(inlet|outlet|farfield)"
    {
        type            freestreamVelocity;
        freestreamValue uniform $UInf;
        value           uniform $UInf;
    }
    model
    {
        type            noSlip;
    }
}


// ************************************************************************* //
