openfoam/all/subsonic/0/alphat
FoamFile { version 2.0; format ascii; class volScalarField; object alphat; }

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet|farfield)" { type calculated; value uniform 0; }
    model                     { type compressible::alphatWallFunction; Prt 0.85; value uniform 0; }
}
