openfoam/all/subsonic/0/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
#include "../constant/freestreamProperties"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInf;

boundaryField
{
    "(inlet|outlet|farfield)" { type freestream; freestreamValue uniform $omegaInf; value uniform $omegaInf; }
    model                     { type omegaWallFunction; value uniform $omegaInf; }
}
