openfoam/all/subsonic/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.05;
    }

    "(U|e|h|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        minIter         1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    transonic       yes;            // high-subsonic (Ma ~0.7) compressible SIMPLE

    residualControl
    {
        p           1e-4;
        U           1e-4;
        e           1e-4;
        "(k|omega)" 1e-4;
    }
}

relaxationFactors
{
    fields
    {
        p           0.3;
        rho         0.05;
    }
    equations
    {
        U           0.7;
        e           0.7;
        "(k|omega)" 0.7;
    }
}


// ************************************************************************* //
