openfoam/all/subsonic/system/postProcess
// Function-object definitions included into controlDict's functions {} block.
// Freestream values + coefficient references come from constant/freestreamProperties.

// rhoSimpleFoam carries a real rho field and absolute pressure (Pa), so
// forceCoeffs integrates real forces (rho = rho) and normalises by the
// freestream dynamic pressure 0.5*rhoInf*magUInf^2*Aref.  Aref/lRef are the
// fixed part="all" references so coefficients are comparable across all cases.
forceCoeffs
{
    type            forceCoeffs;
    libs            (forces);
    patches         (model);
    rho             rho;            // compressible: integrate against live density
    rhoInf          $rhoInf;        // freestream density for the q normalisation
    magUInf         $magUInf;
    Aref            $Aref;
    lRef            $lRef;
    dragDir         $dragDir;
    liftDir         $liftDir;
    pitchAxis       $pitchAxis;
    CofR            $CofR;
    writeControl    timeStep;
    writeInterval   1;
    log             yes;
}

MachNo
{
    type            MachNo;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
}

pressureCoeff
{
    type            pressure;
    libs            (fieldFunctionObjects);
    mode            staticCoeff;
    result          Cp;
    rhoInf          $rhoInf;
    pInf            $pInf;
    UInf            $UInf;
    writeControl    writeTime;
}

yPlus
{
    type         yPlus;
    libs         (fieldFunctionObjects);
    writeControl writeTime;
    log yes;
}

wallShearStress
{
    type         wallShearStress;
    libs         (fieldFunctionObjects);
    patches      (model);
    writeControl writeTime;
}
